improved diagrams
